/*********************************************/
/*Обработка событий.*/
// События в документе это некоторые процессы которые происходят на странице
// условно деляться на пользовательские и браузерные.
// Браузерные - загрузка документа загрузка DOM и их неудачные версии.
// Пользовательские - все остальные (изменение размера окна, клик и т.д.).
// onclick - клик левой кнопкой мыши.
// ondblclick - двойной клик левой кнопкой мыши.
// onchange - изменение значения элементов формы.
// onfocus - событие фокусировки на элементе.
// onblur - событие противоположное (потеря фокуса) предыдущему.
// Код записан в index.html.







